app/controllers/manuscripts_controller.rb

  def index
    @manuscripts = Manuscript.all
---
SELECT `manuscripts`.* FROM `manuscripts`

    def set_manuscript
      @manuscript = Manuscript.find(params[:id])
---
SELECT  `manuscripts`.* FROM `manuscripts` WHERE `manuscripts`.`id` = 0 LIMIT 1